UI/04_ScaledUI/stress_tests/socketio-conn-test-02.yaml
config:
  target: "http://localhost:3002"
  phases:
    - duration: 1200 # 持續1200秒
      arrivalRate: 5 # 每秒產生5個socket連線
  socketio:
    transports: ["websocket"]

scenarios:
  - engine: "socketio"
    flow:
      - think: 1200 # 每個連線連接完成後不作什麼事，但是1200秒就斷開連接